Revit 2027 API
BendingDetailBendDiameterDimensionType Enumeration
 Describes the dimension type for bend diameter.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BendingDetailBendDiameterDimensionType
Public Enumeration BendingDetailBendDiameterDimensionType
public enum class BendingDetailBendDiameterDimensionType
type BendingDetailBendDiameterDimensionType
Members
Member name | Value | Description
Diameter | 1 |  Diameter Dimension Type
Radial | 0 |  Radial Dimension Type
See Also
Reference
Autodesk.Revit.DB.Structure Namespace